import React, { useState } from "react";
import "./loadmore.css";
import Wave from "../../images/wave.png";
import pic from "../../images/hotelmng.jpeg";

const Loadmore = ({ type }) => {
  const [isOpen, setIsOpen] = useState(false);

  const toggleContent = () => {
    setIsOpen(!isOpen);
  };

  return (
    <div>
      {type !== "more" && (
        <div className="loadmore">
          <div className="loadmore__header">
            <h4 className="loadmore__title">
              {" "}
              اولویتمان در مکانی که شما انتخاب کردید را آشنا شوید
            </h4>
            <img className="loadmore__img" src={Wave} alt="wave" />
          </div>
          <div className={`content ${isOpen ? "content--open" : ""}`}>
            <div className="content">
              <div className="content__text">
                به رستوران هتل آریا خوش آمدید، جایی که طعم‌های بی‌نظیر و لحظات
                خوشایند در کنار یکدیگر جمع شده‌اند. ما در اینجا با افتخار به شما
                ارائه دهنده‌ی تجربه‌ای بی‌نظیر از غذاهای متنوع و محیطی دلنشین
                هستیم. رستوران هتل آریا با محیطی گرم و دلپذیر و دکوراسیونی زیبا،
                به شما امکان می‌دهد تا در فضایی آرام و راحت از غذاهای ما لذت
                ببرید. هر گوشه‌ای از رستوران ما با دقت و سلیقه طراحی شده تا شما
                در هر لحظه احساس آرامش و رضایت کنید. از نورپردازی ملایم گرفته تا
                میزهای چیده شده با دقت، همه چیز برای ایجاد یک تجربه غذایی بی‌نقص
                آماده است. آشپزهای ماهر و مجرب ما با استفاده از بهترین و
                تازه‌ترین مواد اولیه، منویی متنوع و خوشمزه را برای شما آماده
                می‌کنند. در رستوران هتل آریا می‌توانید از غذاهای محلی ایرانی تا
                غذاهای بین‌المللی لذت ببرید. هر وعده غذایی با دقت و عشق تهیه
                می‌شود تا شما طعمی بی‌نظیر را تجربه کنید. ما معتقدیم که غذا نه
                تنها باید خوشمزه باشد، بلکه باید به گونه‌ای سرو شود که شما از
                دیدن و خوردن آن لذت ببرید. یکی از نقاط قوت رستوران ما، تنوع
                بی‌نظیر منو است. ما با داشتن منوی گسترده از پیش‌غذاها، غذاهای
                اصلی، دسرها و نوشیدنی‌های متنوع، به تمامی سلیقه‌ها احترام
                می‌گذاریم. چه به دنبال یک غذای سنتی ایرانی باشید و چه دوست دارید
                غذاهای بین‌المللی را امتحان کنید، در اینجا چیزی برای هر ذائقه‌ای
                پیدا خواهید کرد. ما همچنین به سرویس‌دهی عالی اهمیت می‌دهیم. تیم
                ما همواره در تلاش است تا بهترین خدمات را به شما ارائه دهد و از
                لحظه‌ای که وارد رستوران می‌شوید تا زمانی که ما را ترک می‌کنید،
                تجربه‌ای خوشایند و به یاد ماندنی داشته باشید. پرسنل ما با لبخندی
                گرم و برخوردی دوستانه آماده‌اند تا هرگونه نیاز و درخواست شما را
                برآورده کنند. رستوران هتل آریا مکان مناسبی برای برگزاری جشن‌ها،
                مراسم و میهمانی‌های شما نیز می‌باشد. با داشتن فضاهای خصوصی و
                نیمه‌خصوصی، ما می‌توانیم میزبان لحظات خاص شما باشیم. از جشن‌های
                تولد و سالگردها گرفته تا جلسات کاری و ضیافت‌های رسمی، تیم ما
                آماده است تا با ارائه خدماتی بی‌نقص، شما را در خلق خاطراتی
                ماندگار یاری کند. در نهایت، هدف ما در رستوران هتل آریا این است
                که شما از هر لحظه حضورتان در اینجا لذت ببرید. ما از شما دعوت
                می‌کنیم تا به ما بپیوندید و تجربه‌ای متفاوت از غذاخوری را در
                محیطی دلنشین و دوستانه تجربه کنید. ما مشتاقانه منتظر حضور گرم
                شما هستیم.به رستوران هتل آریا خوش آمدید، جایی که طعم‌های بی‌نظیر
                و لحظات خوشایند در کنار یکدیگر جمع شده‌اند. ما در اینجا با
                افتخار به شما ارائه دهنده‌ی تجربه‌ای بی‌نظیر از غذاهای متنوع و
                محیطی دلنشین هستیم. رستوران هتل آریا با محیطی گرم و دلپذیر و
                دکوراسیونی زیبا، به شما امکان می‌دهد تا در فضایی آرام و راحت از
                غذاهای ما لذت ببرید. هر گوشه‌ای از رستوران ما با دقت و سلیقه
                طراحی شده تا شما در هر لحظه احساس آرامش و رضایت کنید. از
                نورپردازی ملایم گرفته تا میزهای چیده شده با دقت، همه چیز برای
                ایجاد یک تجربه غذایی بی‌نقص آماده است. آشپزهای ماهر و مجرب ما با
                استفاده از بهترین و تازه‌ترین مواد اولیه، منویی متنوع و خوشمزه
                را برای شما آماده می‌کنند. در رستوران هتل آریا می‌توانید از
                غذاهای محلی ایرانی تا غذاهای بین‌المللی لذت ببرید. هر وعده غذایی
                با دقت و عشق تهیه می‌شود تا شما طعمی بی‌نظیر را تجربه کنید. ما
                معتقدیم که غذا نه تنها باید خوشمزه باشد، بلکه باید به گونه‌ای
                سرو شود که شما از دیدن و خوردن آن لذت ببرید. یکی از نقاط قوت
                رستوران ما، تنوع بی‌نظیر منو است. ما با داشتن منوی گسترده از
                پیش‌غذاها، غذاهای اصلی، دسرها و نوشیدنی‌های متنوع، به تمامی
                سلیقه‌ها احترام می‌گذاریم. چه به دنبال یک غذای سنتی ایرانی باشید
                و چه دوست دارید غذاهای بین‌المللی را امتحان کنید، در اینجا چیزی
                برای هر ذائقه‌ای پیدا خواهید کرد. ما همچنین به سرویس‌دهی عالی
                اهمیت می‌دهیم. تیم ما همواره در تلاش است تا بهترین خدمات را به
                شما ارائه دهد و از لحظه‌ای که وارد رستوران می‌شوید تا زمانی که
                ما را ترک می‌کنید، تجربه‌ای خوشایند و به یاد ماندنی داشته باشید.
                پرسنل ما با لبخندی گرم و برخوردی دوستانه آماده‌اند تا هرگونه
                نیاز و درخواست شما را برآورده کنند. رستوران هتل آریا مکان مناسبی
                برای برگزاری جشن‌ها، مراسم و میهمانی‌های شما نیز می‌باشد. با
                داشتن فضاهای خصوصی و نیمه‌خصوصی، ما می‌توانیم میزبان لحظات خاص
                شما باشیم. از جشن‌های تولد و سالگردها گرفته تا جلسات کاری و
                ضیافت‌های رسمی، تیم ما آماده است تا با ارائه خدماتی بی‌نقص، شما
                را در خلق خاطراتی ماندگار یاری کند. در نهایت، هدف ما در رستوران
                هتل آریا این است که شما از هر لحظه حضورتان در اینجا لذت ببرید.
                ما از شما دعوت می‌کنیم تا به ما بپیوندید و تجربه‌ای متفاوت از
                غذاخوری را در محیطی دلنشین و دوستانه تجربه کنید. ما مشتاقانه
                منتظر حضور گرم شما هستیم.به رستوران هتل آریا خوش آمدید، جایی که
                طعم‌های بی‌نظیر و لحظات خوشایند در کنار یکدیگر جمع شده‌اند. ما
                در اینجا با افتخار به شما ارائه دهنده‌ی تجربه‌ای بی‌نظیر از
                غذاهای متنوع و محیطی دلنشین هستیم. رستوران هتل آریا با محیطی گرم
                و دلپذیر و دکوراسیونی زیبا، به شما امکان می‌دهد تا در فضایی آرام
                و راحت از غذاهای ما لذت ببرید. هر گوشه‌ای از رستوران ما با دقت و
                سلیقه طراحی شده تا شما در هر لحظه احساس آرامش و رضایت کنید. از
                نورپردازی ملایم گرفته تا میزهای چیده شده با دقت، همه چیز برای
                ایجاد یک تجربه غذایی بی‌نقص آماده است. آشپزهای ماهر و مجرب ما با
                استفاده از بهترین و تازه‌ترین مواد اولیه، منویی متنوع و خوشمزه
                را برای شما آماده می‌کنند. در رستوران هتل آریا می‌توانید از
                غذاهای محلی ایرانی تا غذاهای بین‌المللی لذت ببرید. هر وعده غذایی
                با دقت و عشق تهیه می‌شود تا شما طعمی بی‌نظیر را تجربه کنید. ما
                معتقدیم که غذا نه تنها باید خوشمزه باشد، بلکه باید به گونه‌ای
                سرو شود که شما از دیدن و خوردن آن لذت ببرید. یکی از نقاط قوت
                رستوران ما، تنوع بی‌نظیر منو است. ما با داشتن منوی گسترده از
                پیش‌غذاها، غذاهای اصلی، دسرها و نوشیدنی‌های متنوع، به تمامی
                سلیقه‌ها احترام می‌گذاریم. چه به دنبال یک غذای سنتی ایرانی باشید
                و چه دوست دارید غذاهای بین‌المللی را امتحان کنید، در اینجا چیزی
                برای هر ذائقه‌ای پیدا خواهید کرد. ما همچنین به سرویس‌دهی عالی
                اهمیت می‌دهیم. تیم ما همواره در تلاش است تا بهترین خدمات را به
                شما ارائه دهد و از لحظه‌ای که وارد رستوران می‌شوید تا زمانی که
                ما را ترک می‌کنید، تجربه‌ای خوشایند و به یاد ماندنی داشته باشید.
                پرسنل ما با لبخندی گرم و برخوردی دوستانه آماده‌اند تا هرگونه
                نیاز و درخواست شما را برآورده کنند. رستوران هتل آریا مکان مناسبی
                برای برگزاری جشن‌ها، مراسم و میهمانی‌های شما نیز می‌باشد. با
                داشتن فضاهای خصوصی و نیمه‌خصوصی، ما می‌توانیم میزبان لحظات خاص
                شما باشیم. از جشن‌های تولد و سالگردها گرفته تا جلسات کاری و
                ضیافت‌های رسمی، تیم ما آماده است تا با ارائه خدماتی بی‌نقص، شما
                را در خلق خاطراتی ماندگار یاری کند. در نهایت، هدف ما در رستوران
                هتل آریا این است که شما از هر لحظه حضورتان در اینجا لذت ببرید.
                ما از شما دعوت می‌کنیم تا به ما بپیوندید و تجربه‌ای متفاوت از
                غذاخوری را در محیطی دلنشین و دوستانه تجربه کنید. ما مشتاقانه
                منتظر حضور گرم شما هستیم.
              </div>
              <div className="content__img">
                <img
                  src={pic}
                  alt="Hotel-Manage"
                  width={"400px"}
                  height={"300px"}
                />
              </div>
            </div>
            <div className="content__shadow"></div>
            <button
              className="content__btn"
              type="button"
              onClick={toggleContent}
            >
              <span className="content__open-text">
                بروشور رستوران هتل آریا{" "}
              </span>
              <span className="content__close-text">مشاهده کردم</span>
            </button>
          </div>
        </div>
      )}
    </div>
  );
};

export default Loadmore;
